// Title: Linux Shell Pipe to Shell
// Author: Florian Roth (Nextron Systems)
// Date: 2022-03-14
// Level: medium
// Description: Detects suspicious process command line that starts with a shell that executes something and finally gets piped into another shell
// MITRE Tactic: Defense Evasion
// Tags: attack.defense-evasion, attack.t1140
// Reference: https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_pipe_shell.yml
// False Positives:
//   - Legitimate software that uses these patterns

DeviceProcessEvents
| where (ProcessCommandLine startswith "sh -c " or ProcessCommandLine startswith "bash -c ") and ((ProcessCommandLine contains "| bash " or ProcessCommandLine contains "| sh " or ProcessCommandLine contains "|bash " or ProcessCommandLine contains "|sh ") or (ProcessCommandLine endswith "| bash" or ProcessCommandLine endswith "| sh" or ProcessCommandLine endswith "|bash" or ProcessCommandLine endswith " |sh"))