// Author: frack113
// Date: 2022/01/22
// Level: medium
// Description: Hides the file extension through modification of the registry
// Tags: attack.persistence, attack.t1137
DeviceRegistryEvents
| where RegistryKey contains "\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap\\Domains" and (not((RegistryValueData in~ ("DWORD (0x00000000)", "DWORD (0x00000001)", "(Empty)"))))