// Author: Tobias Michalski (Nextron Systems)
// Date: 2021/06/09
// Level: high
// Description: Detects potential persistence activity via outlook home pages.
// Tags: attack.persistence, attack.t1112
DeviceRegistryEvents
| where ((RegistryKey contains "\\Software\\Microsoft\\Office" or RegistryKey contains "\\Outlook\\WebView") and RegistryKey endswith "\\URL") and (RegistryKey contains "\\Calendar" or RegistryKey contains "\\Inbox")