// Author: Nasreddine Bencherchali (Nextron Systems)
// Date: 2022/11/10
// Level: medium
// Description: Detects usage of the Get-ADComputer cmdlet to collect computer information and output it to a file
// Tags: attack.discovery, attack.t1033
DeviceProcessEvents
| where ((ProcessCommandLine contains " > " or ProcessCommandLine contains " | Select " or ProcessCommandLine contains "Out-File" or ProcessCommandLine contains "Set-Content" or ProcessCommandLine contains "Add-Content") and (ProcessCommandLine contains "Get-ADComputer " and ProcessCommandLine contains " -Filter \*")) and ((FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe") or (ProcessVersionInfoOriginalFileName in~ ("PowerShell.EXE", "pwsh.dll")))