// Author: frack113
// Date: 2022/10/01
// Level: medium
// Description: Detect use of PDQ Deploy remote admin tool
// Tags: attack.execution, attack.lateral_movement, attack.t1072
DeviceProcessEvents
| where ProcessVersionInfoFileDescription =~ "PDQ Deploy Console" or ProcessVersionInfoProductName =~ "PDQ Deploy" or ProcessVersionInfoCompanyName =~ "PDQ.com" or ProcessVersionInfoOriginalFileName =~ "PDQDeployConsole.exe"