// Author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
// Date: 2019/08/25
// Level: high
// Description: Detects potential malicious modification of the property value of IsCredGuardEnabled from
HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable Cred Guard on a system.
This is usually used with UseLogonCredential to manipulate the caching credentials.

// Tags: attack.defense_evasion, attack.t1112
DeviceRegistryEvents
| where RegistryKey endswith "\\IsCredGuardEnabled"