// Author: Nikita Nazarov, oscd.community
// Date: 2020/10/09
// Level: high
// Description: Detects Obfuscated Powershell via use Clip.exe in Scripts
// Tags: attack.defense_evasion, attack.t1027, attack.execution, attack.t1059.001
DeviceProcessEvents
| where ProcessCommandLine matches regex "(?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)"