// Title: Invoke-Obfuscation Via Stdin
// Author: Nikita Nazarov, oscd.community
// Date: 2020-10-12
// Level: high
// Description: Detects Obfuscated Powershell via Stdin in Scripts
// MITRE Tactic: Defense Evasion
// Tags: attack.defense-evasion, attack.t1027, attack.execution, attack.t1059.001
// Reference: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_stdin.yml

DeviceProcessEvents
| where ProcessCommandLine matches regex "(?i)(set).*&&\\s?set.*(environment|invoke|\\$\\{?input).*&&.*""