// Title: Powershell Token Obfuscation - Process Creation
// Author: frack113
// Date: 2022-12-27
// Level: high
// Description: Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation
// MITRE Tactic: Defense Evasion
// Tags: attack.defense-evasion, attack.t1027.009
// Reference: https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml

DeviceProcessEvents
| where (ProcessCommandLine matches regex "\\w+`(\\w+|-|.)`[\\w+|\\s]" or ProcessCommandLine matches regex ""(\\{\\d\\})+"\\s*-f" or ProcessCommandLine matches regex "(?i)\\$\\{`?e`?n`?v`?:`?p`?a`?t`?h`?\\}") and (not(ProcessCommandLine contains "${env:path}"))