// Author: Nasreddine Bencherchali (Nextron Systems), frack113
// Date: 2023/07/06
// Level: medium
// Description: Detects the excution of a potential recon command where the results are piped to "findstr". This is meant to trigger on inline calls of "cmd.exe" via the "/c" or "/k" for example. Attackers often time use this to extract specific information they require in their chain.

// Tags: attack.discovery, attack.t1057
DeviceProcessEvents
| where ProcessCommandLine contains "ipconfig /all | find " or ProcessCommandLine contains "ipconfig /all | findstr " or ProcessCommandLine contains "ipconfig | find " or ProcessCommandLine contains "ipconfig | findstr " or ProcessCommandLine contains "ipconfig.exe /all | find " or ProcessCommandLine contains "ipconfig.exe /all | findstr " or ProcessCommandLine contains "ipconfig.exe | find " or ProcessCommandLine contains "ipconfig.exe | findstr " or ProcessCommandLine contains "net start | find" or ProcessCommandLine contains "net start | findstr" or ProcessCommandLine contains "net.exe start | find" or ProcessCommandLine contains "net.exe start | findstr" or ProcessCommandLine contains "net1 start | find" or ProcessCommandLine contains "net1 start | findstr" or ProcessCommandLine contains "net1.exe start | find" or ProcessCommandLine contains "net1.exe start | findstr" or ProcessCommandLine contains "netstat -ano | find" or ProcessCommandLine contains "netstat -ano | findstr" or ProcessCommandLine contains "netstat | find" or ProcessCommandLine contains "netstat | findstr" or ProcessCommandLine contains "netstat.exe -ano | find" or ProcessCommandLine contains "netstat.exe -ano | findstr" or ProcessCommandLine contains "netstat.exe | find" or ProcessCommandLine contains "netstat.exe | findstr" or ProcessCommandLine contains "ping | find" or ProcessCommandLine contains "ping | findstr" or ProcessCommandLine contains "ping.exe | find" or ProcessCommandLine contains "ping.exe | findstr" or ProcessCommandLine contains "systeminfo | find " or ProcessCommandLine contains "systeminfo | findstr " or ProcessCommandLine contains "systeminfo.exe | find " or ProcessCommandLine contains "systeminfo.exe | findstr " or ProcessCommandLine contains "tasklist | find " or ProcessCommandLine contains "tasklist | findstr " or ProcessCommandLine contains "tasklist.exe | find " or ProcessCommandLine contains "tasklist.exe | findstr " or ProcessCommandLine contains "whoami /all | find " or ProcessCommandLine contains "whoami /all | findstr " or ProcessCommandLine contains "whoami.exe /all | find " or ProcessCommandLine contains "whoami.exe /all | findstr "