// Author: Kamran Saifullah
// Date: 2023/11/20
// Level: medium
// Description: Detects network connections to Visual Studio Code tunnel domains initiated by a process on a system. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.

// Tags: attack.exfiltration, attack.t1567.001
DeviceNetworkEvents
| where RemoteUrl endswith ".tunnels.api.visualstudio.com"