// Author: Mateusz Wydra, oscd.community
// Date: 2020/10/13
// Level: medium
// Description: Detects creation/modification of Assistive Technology applications and persistence with usage of 'at'
// Tags: attack.defense_evasion, attack.t1218, attack.persistence, attack.t1547
DeviceRegistryEvents
| where (RegistryKey contains "Software\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility\\ATs" or RegistryKey contains "Software\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility\\Configuration") and (not(((RegistryValueData =~ "(Empty)" and InitiatingProcessFolderPath =~ "C:\\Windows\\system32\\atbroker.exe" and RegistryKey contains "\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility\\Configuration") or (InitiatingProcessFolderPath startswith "C:\\Windows\\Installer\\MSI" and RegistryKey contains "Software\\Microsoft\\Windows NT\\CurrentVersion\\Accessibility\\ATs"))))